caiobrunholi/testmauaboards/MauaBoards/1.0.2/variants/MauaBoard_1/boards.txt
menu.UploadSpeed=Upload Speed
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM

maua_board_1.name=MAUA Board 1

maua_board_1.upload.tool=esptool_py
maua_board_1.upload.maximum_size=1310720
maua_board_1.upload.maximum_data_size=327680
maua_board_1.upload.wait_for_upload_port=true

maua_board_1.serial.disableDTR=true
maua_board_1.serial.disableRTS=true

maua_board_1.build.mcu=esp32
maua_board_1.build.core=esp32
maua_board_1.build.variant=esp32
maua_board_1.build.board=ESP32_DEV

maua_board_1.build.f_cpu=240000000L
maua_board_1.build.flash_size=4MB
maua_board_1.build.flash_freq=40m
maua_board_1.build.flash_mode=dio
maua_board_1.build.boot=dio
maua_board_1.build.partitions=huge_app
maua_board_1.build.defines=

maua_board_1.menu.PSRAM.disabled=Disabled
maua_board_1.menu.PSRAM.disabled.build.defines=
maua_board_1.menu.PSRAM.disabled.build.extra_libs=
maua_board_1.menu.PSRAM.enabled=Enabled
maua_board_1.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue
maua_board_1.menu.PSRAM.enabled.build.extra_libs=-lc-psram-workaround -lm-psram-workaround

maua_board_1.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
maua_board_1.menu.PartitionScheme.default.build.partitions=default
maua_board_1.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
maua_board_1.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
maua_board_1.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
maua_board_1.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
maua_board_1.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
maua_board_1.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
maua_board_1.menu.PartitionScheme.minimal.build.partitions=minimal
maua_board_1.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
maua_board_1.menu.PartitionScheme.no_ota.build.partitions=no_ota
maua_board_1.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
maua_board_1.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
maua_board_1.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
maua_board_1.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
maua_board_1.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
maua_board_1.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
maua_board_1.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
maua_board_1.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
maua_board_1.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
maua_board_1.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
maua_board_1.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
maua_board_1.menu.PartitionScheme.huge_app.build.partitions=huge_app
maua_board_1.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
maua_board_1.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
maua_board_1.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
maua_board_1.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
maua_board_1.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
maua_board_1.menu.PartitionScheme.fatflash.build.partitions=ffat
maua_board_1.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
maua_board_1.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
maua_board_1.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
maua_board_1.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

maua_board_1.menu.CPUFreq.240=240MHz (WiFi/BT)
maua_board_1.menu.CPUFreq.240.build.f_cpu=240000000L
maua_board_1.menu.CPUFreq.160=160MHz (WiFi/BT)
maua_board_1.menu.CPUFreq.160.build.f_cpu=160000000L
maua_board_1.menu.CPUFreq.80=80MHz (WiFi/BT)
maua_board_1.menu.CPUFreq.80.build.f_cpu=80000000L
maua_board_1.menu.CPUFreq.40=40MHz (40MHz XTAL)
maua_board_1.menu.CPUFreq.40.build.f_cpu=40000000L
maua_board_1.menu.CPUFreq.26=26MHz (26MHz XTAL)
maua_board_1.menu.CPUFreq.26.build.f_cpu=26000000L
maua_board_1.menu.CPUFreq.20=20MHz (40MHz XTAL)
maua_board_1.menu.CPUFreq.20.build.f_cpu=20000000L
maua_board_1.menu.CPUFreq.13=13MHz (26MHz XTAL)
maua_board_1.menu.CPUFreq.13.build.f_cpu=13000000L
maua_board_1.menu.CPUFreq.10=10MHz (40MHz XTAL)
maua_board_1.menu.CPUFreq.10.build.f_cpu=10000000L

maua_board_1.menu.FlashMode.qio=QIO
maua_board_1.menu.FlashMode.qio.build.flash_mode=dio
maua_board_1.menu.FlashMode.qio.build.boot=qio
maua_board_1.menu.FlashMode.dio=DIO
maua_board_1.menu.FlashMode.dio.build.flash_mode=dio
maua_board_1.menu.FlashMode.dio.build.boot=dio
maua_board_1.menu.FlashMode.qout=QOUT
maua_board_1.menu.FlashMode.qout.build.flash_mode=dout
maua_board_1.menu.FlashMode.qout.build.boot=qout
maua_board_1.menu.FlashMode.dout=DOUT
maua_board_1.menu.FlashMode.dout.build.flash_mode=dout
maua_board_1.menu.FlashMode.dout.build.boot=dout

maua_board_1.menu.FlashFreq.80=80MHz
maua_board_1.menu.FlashFreq.80.build.flash_freq=80m
maua_board_1.menu.FlashFreq.40=40MHz
maua_board_1.menu.FlashFreq.40.build.flash_freq=40m

maua_board_1.menu.FlashSize.4M=4MB (32Mb)
maua_board_1.menu.FlashSize.4M.build.flash_size=4MB
maua_board_1.menu.FlashSize.8M=8MB (64Mb)
maua_board_1.menu.FlashSize.8M.build.flash_size=8MB
maua_board_1.menu.FlashSize.8M.build.partitions=default_8MB
maua_board_1.menu.FlashSize.2M=2MB (16Mb)
maua_board_1.menu.FlashSize.2M.build.flash_size=2MB
maua_board_1.menu.FlashSize.2M.build.partitions=minimal
maua_board_1.menu.FlashSize.16M=16MB (128Mb)
maua_board_1.menu.FlashSize.16M.build.flash_size=16MB

maua_board_1.menu.UploadSpeed.921600=921600
maua_board_1.menu.UploadSpeed.921600.upload.speed=921600
maua_board_1.menu.UploadSpeed.115200=115200
maua_board_1.menu.UploadSpeed.115200.upload.speed=115200
maua_board_1.menu.UploadSpeed.256000.windows=256000
maua_board_1.menu.UploadSpeed.256000.upload.speed=256000
maua_board_1.menu.UploadSpeed.230400.windows.upload.speed=256000
maua_board_1.menu.UploadSpeed.230400=230400
maua_board_1.menu.UploadSpeed.230400.upload.speed=230400
maua_board_1.menu.UploadSpeed.460800.linux=460800
maua_board_1.menu.UploadSpeed.460800.macosx=460800
maua_board_1.menu.UploadSpeed.460800.upload.speed=460800
maua_board_1.menu.UploadSpeed.512000.windows=512000
maua_board_1.menu.UploadSpeed.512000.upload.speed=512000

maua_board_1.menu.DebugLevel.none=None
maua_board_1.menu.DebugLevel.none.build.code_debug=0
maua_board_1.menu.DebugLevel.error=Error
maua_board_1.menu.DebugLevel.error.build.code_debug=1
maua_board_1.menu.DebugLevel.warn=Warn
maua_board_1.menu.DebugLevel.warn.build.code_debug=2
maua_board_1.menu.DebugLevel.info=Info
maua_board_1.menu.DebugLevel.info.build.code_debug=3
maua_board_1.menu.DebugLevel.debug=Debug
maua_board_1.menu.DebugLevel.debug.build.code_debug=4
maua_board_1.menu.DebugLevel.verbose=Verbose
maua_board_1.menu.DebugLevel.verbose.build.code_debug=5


